benchmark.txt
====== GET ======
  1000000 requests completed in 0.94 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 9.383 milliseconds (cumulative count 64)
50.000% <= 19.023 milliseconds (cumulative count 502144)
75.000% <= 21.599 milliseconds (cumulative count 750272)
87.500% <= 26.271 milliseconds (cumulative count 875136)
93.750% <= 87.615 milliseconds (cumulative count 937536)
96.875% <= 116.991 milliseconds (cumulative count 968768)
98.438% <= 131.455 milliseconds (cumulative count 984384)
99.219% <= 137.599 milliseconds (cumulative count 992192)
99.609% <= 139.007 milliseconds (cumulative count 996224)
99.805% <= 139.775 milliseconds (cumulative count 998144)
99.902% <= 140.415 milliseconds (cumulative count 999104)
99.951% <= 140.543 milliseconds (cumulative count 999552)
99.976% <= 140.671 milliseconds (cumulative count 999936)
99.994% <= 140.799 milliseconds (cumulative count 1000000)
100.000% <= 140.799 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.307% <= 10.103 milliseconds (cumulative count 3072)
0.640% <= 11.103 milliseconds (cumulative count 6400)
0.678% <= 12.103 milliseconds (cumulative count 6784)
1.242% <= 13.103 milliseconds (cumulative count 12416)
4.845% <= 14.103 milliseconds (cumulative count 48448)
12.250% <= 15.103 milliseconds (cumulative count 122496)
19.686% <= 16.103 milliseconds (cumulative count 196864)
25.395% <= 17.103 milliseconds (cumulative count 253952)
35.968% <= 18.111 milliseconds (cumulative count 359680)
51.872% <= 19.103 milliseconds (cumulative count 518720)
66.330% <= 20.111 milliseconds (cumulative count 663296)
73.312% <= 21.103 milliseconds (cumulative count 733120)
76.570% <= 22.111 milliseconds (cumulative count 765696)
79.296% <= 23.103 milliseconds (cumulative count 792960)
81.306% <= 24.111 milliseconds (cumulative count 813056)
83.891% <= 25.103 milliseconds (cumulative count 838912)
87.072% <= 26.111 milliseconds (cumulative count 870720)
88.198% <= 27.103 milliseconds (cumulative count 881984)
88.275% <= 28.111 milliseconds (cumulative count 882752)
88.339% <= 29.103 milliseconds (cumulative count 883392)
88.416% <= 30.111 milliseconds (cumulative count 884160)
88.474% <= 31.103 milliseconds (cumulative count 884736)
88.531% <= 32.111 milliseconds (cumulative count 885312)
88.582% <= 33.119 milliseconds (cumulative count 885824)
88.659% <= 34.111 milliseconds (cumulative count 886592)
88.710% <= 35.103 milliseconds (cumulative count 887104)
88.762% <= 36.127 milliseconds (cumulative count 887616)
88.851% <= 37.119 milliseconds (cumulative count 888512)
88.909% <= 38.111 milliseconds (cumulative count 889088)
88.954% <= 39.103 milliseconds (cumulative count 889536)
89.024% <= 40.127 milliseconds (cumulative count 890240)
89.075% <= 41.119 milliseconds (cumulative count 890752)
89.107% <= 42.111 milliseconds (cumulative count 891072)
89.171% <= 43.103 milliseconds (cumulative count 891712)
89.235% <= 44.127 milliseconds (cumulative count 892352)
89.344% <= 45.119 milliseconds (cumulative count 893440)
89.472% <= 46.111 milliseconds (cumulative count 894720)
89.504% <= 47.103 milliseconds (cumulative count 895040)
89.542% <= 48.127 milliseconds (cumulative count 895424)
89.619% <= 49.119 milliseconds (cumulative count 896192)
89.722% <= 50.111 milliseconds (cumulative count 897216)
89.850% <= 51.103 milliseconds (cumulative count 898496)
89.939% <= 52.127 milliseconds (cumulative count 899392)
90.048% <= 53.119 milliseconds (cumulative count 900480)
90.144% <= 54.111 milliseconds (cumulative count 901440)
90.234% <= 55.103 milliseconds (cumulative count 902336)
90.342% <= 56.127 milliseconds (cumulative count 903424)
90.432% <= 57.119 milliseconds (cumulative count 904320)
90.547% <= 58.111 milliseconds (cumulative count 905472)
90.669% <= 59.103 milliseconds (cumulative count 906688)
90.765% <= 60.127 milliseconds (cumulative count 907648)
90.874% <= 61.119 milliseconds (cumulative count 908736)
90.976% <= 62.111 milliseconds (cumulative count 909760)
91.066% <= 63.103 milliseconds (cumulative count 910656)
91.213% <= 64.127 milliseconds (cumulative count 912128)
91.315% <= 65.119 milliseconds (cumulative count 913152)
91.405% <= 66.111 milliseconds (cumulative count 914048)
91.501% <= 67.135 milliseconds (cumulative count 915008)
91.616% <= 68.159 milliseconds (cumulative count 916160)
91.731% <= 69.119 milliseconds (cumulative count 917312)
91.846% <= 70.143 milliseconds (cumulative count 918464)
91.949% <= 71.103 milliseconds (cumulative count 919488)
92.051% <= 72.127 milliseconds (cumulative count 920512)
92.160% <= 73.151 milliseconds (cumulative count 921600)
92.262% <= 74.111 milliseconds (cumulative count 922624)
92.365% <= 75.135 milliseconds (cumulative count 923648)
92.486% <= 76.159 milliseconds (cumulative count 924864)
92.582% <= 77.119 milliseconds (cumulative count 925824)
92.698% <= 78.143 milliseconds (cumulative count 926976)
92.794% <= 79.103 milliseconds (cumulative count 927936)
92.896% <= 80.127 milliseconds (cumulative count 928960)
93.024% <= 81.151 milliseconds (cumulative count 930240)
93.152% <= 82.111 milliseconds (cumulative count 931520)
93.274% <= 83.135 milliseconds (cumulative count 932736)
93.370% <= 84.159 milliseconds (cumulative count 933696)
93.472% <= 85.119 milliseconds (cumulative count 934720)
93.600% <= 86.143 milliseconds (cumulative count 936000)
93.690% <= 87.103 milliseconds (cumulative count 936896)
93.830% <= 88.127 milliseconds (cumulative count 938304)
93.958% <= 89.151 milliseconds (cumulative count 939584)
94.054% <= 90.111 milliseconds (cumulative count 940544)
94.150% <= 91.135 milliseconds (cumulative count 941504)
94.259% <= 92.159 milliseconds (cumulative count 942592)
94.355% <= 93.119 milliseconds (cumulative count 943552)
94.483% <= 94.143 milliseconds (cumulative count 944832)
94.592% <= 95.103 milliseconds (cumulative count 945920)
94.694% <= 96.127 milliseconds (cumulative count 946944)
94.810% <= 97.151 milliseconds (cumulative count 948096)
94.918% <= 98.111 milliseconds (cumulative count 949184)
95.027% <= 99.135 milliseconds (cumulative count 950272)
95.155% <= 100.159 milliseconds (cumulative count 951552)
95.245% <= 101.119 milliseconds (cumulative count 952448)
95.328% <= 102.143 milliseconds (cumulative count 953280)
95.430% <= 103.103 milliseconds (cumulative count 954304)
95.533% <= 104.127 milliseconds (cumulative count 955328)
95.661% <= 105.151 milliseconds (cumulative count 956608)
95.770% <= 106.111 milliseconds (cumulative count 957696)
95.859% <= 107.135 milliseconds (cumulative count 958592)
95.987% <= 108.159 milliseconds (cumulative count 959872)
96.083% <= 109.119 milliseconds (cumulative count 960832)
96.179% <= 110.143 milliseconds (cumulative count 961792)
96.307% <= 111.103 milliseconds (cumulative count 963072)
96.410% <= 112.127 milliseconds (cumulative count 964096)
96.493% <= 113.151 milliseconds (cumulative count 964928)
96.602% <= 114.111 milliseconds (cumulative count 966016)
96.685% <= 115.135 milliseconds (cumulative count 966848)
96.794% <= 116.159 milliseconds (cumulative count 967936)
96.896% <= 117.119 milliseconds (cumulative count 968960)
97.024% <= 118.143 milliseconds (cumulative count 970240)
97.126% <= 119.103 milliseconds (cumulative count 971264)
97.216% <= 120.127 milliseconds (cumulative count 972160)
97.338% <= 121.151 milliseconds (cumulative count 973376)
97.434% <= 122.111 milliseconds (cumulative count 974336)
97.542% <= 123.135 milliseconds (cumulative count 975424)
97.651% <= 124.159 milliseconds (cumulative count 976512)
97.734% <= 125.119 milliseconds (cumulative count 977344)
97.875% <= 126.143 milliseconds (cumulative count 978752)
97.971% <= 127.103 milliseconds (cumulative count 979712)
98.093% <= 128.127 milliseconds (cumulative count 980928)
98.202% <= 129.151 milliseconds (cumulative count 982016)
98.317% <= 130.111 milliseconds (cumulative count 983168)
98.426% <= 131.199 milliseconds (cumulative count 984256)
98.528% <= 132.223 milliseconds (cumulative count 985280)
98.637% <= 133.119 milliseconds (cumulative count 986368)
98.739% <= 134.143 milliseconds (cumulative count 987392)
98.842% <= 135.167 milliseconds (cumulative count 988416)
98.970% <= 136.191 milliseconds (cumulative count 989696)
99.104% <= 137.215 milliseconds (cumulative count 991040)
99.366% <= 138.111 milliseconds (cumulative count 993664)
99.648% <= 139.135 milliseconds (cumulative count 996480)
99.885% <= 140.159 milliseconds (cumulative count 998848)
100.000% <= 141.183 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 1067235.88 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
       27.088     9.376    19.023    98.943   136.575   140.799